F = [
    0,-1,0,10;
    1,0,0,20;
    0,0,1,1;
    0,0,0,1
];

uf = [
    3;
    2;
    2;
    1;
];

% (1) 确定表示同一点但由基坐标系描述的矢量 $\boldsymbol{u}$。
u = F * uf

% (2) 首先让 $\boldsymbol{F}$ 绕基坐标系的 $y$ 轴旋转 $90^\circ$，然后沿基系 $x$ 轴方向平移 20 个单位。求变换所得新坐标系 $\boldsymbol{F}'$。

theta = pi / 2;
s = sin(theta);
c = cos(theta);

T = [
    0,0,1,20;
    0,1,0,0;
    -1,0,0,0;
    0,0,0,1
];

F1 = T * F

% (3) 确定表示同一点但由坐标系 $\boldsymbol{F}'$ 所描述的矢量 $\boldsymbol{v}'$。
v = inv(F1) * u

% (4) 让 $\boldsymbol{F}$ 绕自己的 $y$ 轴旋转 $90^\circ$，求变换所得新坐标系 $\boldsymbol{F}''$
T1 = [
    0,0,1,0;
    0,1,0,0;
    -1,0,0,0;
    0,0,0,1
];
F11 = F * T1