TWC = [
        1,  0,  0,  830;
        0,  1,  0,  20;
        0,  0,  1,  330;
        0,  0,  0,  1
      ] * [
            cosd(35),   -sind(35),  0,  -280;
            sind(35),   cosd(35),   0,  250;
            0,          0,          1,  62.5;
            0,          0,          0,  1
          ]; % TWC = TWD * TDC
% 由TWC = TW0 * T06 * T6C求出T06
% T06 = inv(TW0) * TWC * inv(T6C);不推荐用 inv(A) 来做矩阵运算,计算逆矩阵会放大误差,效率较低
% 使用除法
TW0 = [
        1,0,0,0;
        0,1,0,0;
        0,0,1,373;
        0,0,0,1
      ];
T6C = [
        0,0,1,0;
        0,-1,0,0;
        1,0,0,206;
        0,0,0,1
      ];
T06 =  TW0 \ TWC / T6C;
P06_ORG = [T06(1,4);T06(2,4);T06(3,4);];
% pieper法求出theta角
% 先求theta1-3
[theta1, theta2, theta3] = pieper(-30, 340, -40, -90, 0, -90, 0, 0, 338, ...
                                  T06(1,4), T06(2,4), T06(3,4));

theta = [theta1, theta2, theta3]; % 最后得到4 * 3矩阵，即有多组解
% 由theta1-3求theta4
% 取一组值
theta = [21.7160, -52.1867, 2.4824];

% 利用Z_Y_Z求theta4,5,6
% 由于前三轴已确定末端位置，后三轴为球腕结构，其旋转不改变末端位
% 置，只改变姿态。因此在求解 θ4、θ5、θ6 时，仅需根据旋转矩阵描述
% 姿态变化，无需再考虑位置。

% 利用DH得旋转矩阵
T01 = DH(0,0,0,theta(1));
T12 = DH(-30,-90,0,theta(2));
T23 = DH(340,0,0,theta(3));
T03 = T01 * T12 * T23;
R03 = T03(1:3, 1:3);

R06 = T06(1:3,1:3);
R36 = R03' * R06;

[phi, beta, psi] = inv_zyz(R36); % 得到欧拉角

disp([phi, beta, psi]);% 得到欧拉角注意不是theta

% 由dh与zyz的角度关系可以求出theta4-6
  
% θ1, θ2, θ3 决定第3坐标系的位姿（位置和部分姿态），
% θ4, θ5, θ6 在此基础上补偿剩余姿态，使末端达到目标姿态。
